#โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
	#หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
	#หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
	#หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
	#หากผู้ใช้ป้อนสายรถเมล์ 56 แสดงข้อความ สาย 56 ไปบางลำพู สะพานกรุงธน
	#หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
	#หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('-------------------------------')
print('  โปรแกรมตรวจสอบข้อมูลสายรถเมล์')
print('-------------------------------')

car = int(input('กรอกสายรถเมล์'))
valid_car = [57,3,71,56,539]

if car in valid_car:
 if car == 57:
    print('สาย57 ไปปิ่นเกล้า บางขุนนนท์')
 elif car == 3:
    print('สาย3 ไปสนามหลวง ลาดพร้าว')
 elif car == 71:
    print('สาย71 ไปหัวลำโพง เยาวราช')
 elif car == 56:
    print('สาย56 ไปบางลำพู สะพานกรุงธน')
 elif car == 539:
    print('สาย539 ไปอนุสวรีย์ชัย สามเสน')
 else :
    print('ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม')