# Control Flow แบ่งเป็น 2 กลุ่ม Control Statement แยกเป็น 2 กลุ่มเช่นกัน
#  1. Selection/Decision เลือกทำ คือ ต้องพิสูจน์ตรวจสอบก่อนทำงานใดๆ แยกเป็น 3 แบบย่อย
#  - พิสุจน์ตรวจสอบครั้งเดียว จริงทำ เท็จไม่ทำ (if)
#  - พิสูจน์ตรวจสอบครั้งเดียว จริงทำ เท้จก็ทำ  (if-else)
#  - พิสูจน์ตรวจสอบหลายครั้ง               (if-elif-else)

#  2. Loop/Iteration ทำซ้ำ คือ ทำงานเดิมๆ ซ้ำ แยกเป็น 2 แบบ
#  -รู้จำนวนครั้งในการทำซ้ำ
#  -ไม่รู้จำนวนครั้งในการทำซ้ำ
# ***สิ่งที่ต้องระวังในการทำซ้ำ คือ ต้องรู้จบ

# ***Statment ที่เกี่ยวกับ Control Flow คือคำสั่ง break, continue โดยเฉพาะ loop