#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน 
#และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
     #ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
     #ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
     #ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
     #ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print('---------------------------')
print('     โปรแกรม Product Sale ')
print('---------------------------')
pro_id = input('ป้อนรหัสสินค้า:')
pro_name = input('ป้อนชื่อสินค้า:')
pro_type = input('ป้อนประเภทสินค้า (F/f, W/w, M/m, K/k):')
pro_price = float( input('ป้อนราคาสินค้า: '))
print('---------------------------')
if pro_type == 'F' or pro_type == 'f' :
    pro_sale = pro_price - (pro_price * 2 / 100)
    print(f'ราคาสินค้าที่ลดแล้วเป็น {pro_sale} บาท')
elif pro_type == 'W' or pro_type == 'w' :
    pro_sale = pro_price - (pro_price * 4 / 100)
    print(f'ราคาสินค้าลดแล้วเป็น {pro_sale} บาท')    
elif pro_type == 'M' or pro_type == 'm' :
    pro_sale = pro_price - (pro_price * 6 / 100)
    print(f'ราคาสินค้าลดแล้วเป็น {pro_sale} บาท')    
elif pro_type == 'K' or pro_type == 'k' :
    pro_sale = pro_price - (pro_price * 10 / 100)
    print(f'ราคาสินค้าลดแล้วเป็น {pro_sale} บาท')    
else :
    print('คุณป้องประเภทผิด !!! ต๊าย ตาย ป้อนผิด ป้อนใหม่อีกครั้งนะ...')  
print('---------------------------')      