# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ 
# ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('--------------------')
print('โปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวน')
print('--------------------')

while True:
    n1 = int(input('ป้อนตัวเลขที่ 1 : '))
    n2 = int(input('ป้อนตัวเลขที่ 2 : '))
    result = n1 * n2
    print(n1,'x',n2,'=',result)
    print('--------------------')
    if result > 5000:
        break