#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า 
#"รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า 
#"รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('-----------------------------------')
print('  โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('-----------------------------------')

number = input('ทะเบียนรถ: ')
weight = int(input('น้ำหนักรถบรรทุก: '))

if weight == 1000:
    print(f'รถของคุณทะเบียน {number} น้ำหนักผ่านเกณฑ์')
elif weight > 1000:
    print(f'รถของคุณทะเบียน {number} น้ำหนักไม่ผ่านเกณฑ์')