#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้ ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด  1% จากยอดขาย ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด     3% จากยอดขายขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด  5% จากยอดขาย
 
print('--------------------------------------------')
print('   โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
print('--------------------------------------------')
A = input('ป้อนรหัสพนักงาน: ')
B = input('ป้อนชื่อพนักงาน: ')
D = float(input('ป้อนจำนวนยอดขาย: '))
print('--------------------------------------------')
if D <= 1000 :
    E = D * 0
elif D <= 2000 :
    E = D * 0.01
elif D <= 3000 :
    E = D * 0.03
else :
    E = D * 0.05
   
print(f'รหัสพนักงาน: {A}')
print(f'ชื่อพนักงาน: {B}')
print(f'ยอดขาย: {D}')
print(f'ค่าคอมมิชชั่น: {E}')
print('--------------------------------------------')